stm32-rs/stm32l4xx-hal/src/serial.rs
pins! {
    USART2: (PA2, PA3, PA1, AF7),
    USART2: (PA2, PA3, PD4, AF7),
    USART2: (PD5, PA3, PA1, AF7),
    USART2: (PD5, PA3, PD4, AF7),
    USART2: (PA2, PD6, PA1, AF7),
    USART2: (PA2, PD6, PD4, AF7),
    USART2: (PD5, PD6, PA1, AF7),
    USART2: (PD5, PD6, PD4, AF7),
}

// USART 3
#[cfg(any(feature = "stm32l4x2", feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    //  USART3: (tx: (PB10, PC4, PC10), rx: (PB11, PC5, PC11), rts: (PB1, PB14, PD2, PD12), cts: (PA6, PB13, PD11), AF7),
    USART3: (PB10, PB11, AF7),
    USART3: (PC4, PB11, AF7),
    USART3: (PC10, PB11, AF7),
    USART3: (PB10, PC5, AF7),
    USART3: (PC4, PC5, AF7),
    USART3: (PC10, PC5, AF7),
    USART3: (PB10, PC11, AF7),
    USART3: (PC4, PC11, AF7),
    USART3: (PC10, PC11, AF7),
}

#[cfg(any(feature = "stm32l4x2", feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    USART3: (PB10, PB11, PB1, PA6, AF7),
    USART3: (PB10, PB11, PB1, PB13, AF7),
    USART3: (PB10, PB11, PB1, PD11, AF7),
    USART3: (PB10, PB11, PB14, PA6, AF7),
    USART3: (PB10, PB11, PB14, PB13, AF7),
    USART3: (PB10, PB11, PB14, PD11, AF7),
    USART3: (PB10, PB11, PD2, PA6, AF7),
    USART3: (PB10, PB11, PD2, PB13, AF7),
    USART3: (PB10, PB11, PD2, PD11, AF7),
    USART3: (PB10, PB11, PD12, PA6, AF7),
    USART3: (PB10, PB11, PD12, PB13, AF7),
    USART3: (PB10, PB11, PD12, PD11, AF7),
    USART3: (PC4, PB11, PB1, PA6, AF7),
    USART3: (PC4, PB11, PB1, PB13, AF7),
    USART3: (PC4, PB11, PB1, PD11, AF7),
    USART3: (PC4, PB11, PB14, PA6, AF7),
    USART3: (PC4, PB11, PB14, PB13, AF7),
    USART3: (PC4, PB11, PB14, PD11, AF7),
    USART3: (PC4, PB11, PD2, PA6, AF7),
    USART3: (PC4, PB11, PD2, PB13, AF7),
    USART3: (PC4, PB11, PD2, PD11, AF7),
    USART3: (PC4, PB11, PD12, PA6, AF7),
    USART3: (PC4, PB11, PD12, PB13, AF7),
    USART3: (PC4, PB11, PD12, PD11, AF7),
    USART3: (PC10, PB11, PB1, PA6, AF7),
    USART3: (PC10, PB11, PB1, PB13, AF7),
    USART3: (PC10, PB11, PB1, PD11, AF7),
    USART3: (PC10, PB11, PB14, PA6, AF7),
    USART3: (PC10, PB11, PB14, PB13, AF7),
    USART3: (PC10, PB11, PB14, PD11, AF7),
    USART3: (PC10, PB11, PD2, PA6, AF7),
    USART3: (PC10, PB11, PD2, PB13, AF7),
    USART3: (PC10, PB11, PD2, PD11, AF7),
    USART3: (PC10, PB11, PD12, PA6, AF7),
    USART3: (PC10, PB11, PD12, PB13, AF7),
    USART3: (PC10, PB11, PD12, PD11, AF7),
    USART3: (PB10, PC5, PB1, PA6, AF7),
    USART3: (PB10, PC5, PB1, PB13, AF7),
    USART3: (PB10, PC5, PB1, PD11, AF7),
    USART3: (PB10, PC5, PB14, PA6, AF7),
    USART3: (PB10, PC5, PB14, PB13, AF7),
    USART3: (PB10, PC5, PB14, PD11, AF7),
    USART3: (PB10, PC5, PD2, PA6, AF7),
    USART3: (PB10, PC5, PD2, PB13, AF7),
    USART3: (PB10, PC5, PD2, PD11, AF7),
    USART3: (PB10, PC5, PD12, PA6, AF7),
    USART3: (PB10, PC5, PD12, PB13, AF7),
    USART3: (PB10, PC5, PD12, PD11, AF7),
    USART3: (PC4, PC5, PB1, PA6, AF7),
    USART3: (PC4, PC5, PB1, PB13, AF7),
    USART3: (PC4, PC5, PB1, PD11, AF7),
    USART3: (PC4, PC5, PB14, PA6, AF7),
    USART3: (PC4, PC5, PB14, PB13, AF7),
    USART3: (PC4, PC5, PB14, PD11, AF7),
    USART3: (PC4, PC5, PD2, PA6, AF7),
    USART3: (PC4, PC5, PD2, PB13, AF7),
    USART3: (PC4, PC5, PD2, PD11, AF7),
    USART3: (PC4, PC5, PD12, PA6, AF7),
    USART3: (PC4, PC5, PD12, PB13, AF7),
    USART3: (PC4, PC5, PD12, PD11, AF7),
    USART3: (PC10, PC5, PB1, PA6, AF7),
    USART3: (PC10, PC5, PB1, PB13, AF7),
    USART3: (PC10, PC5, PB1, PD11, AF7),
    USART3: (PC10, PC5, PB14, PA6, AF7),
    USART3: (PC10, PC5, PB14, PB13, AF7),
    USART3: (PC10, PC5, PB14, PD11, AF7),
    USART3: (PC10, PC5, PD2, PA6, AF7),
    USART3: (PC10, PC5, PD2, PB13, AF7),
    USART3: (PC10, PC5, PD2, PD11, AF7),
    USART3: (PC10, PC5, PD12, PA6, AF7),
    USART3: (PC10, PC5, PD12, PB13, AF7),
    USART3: (PC10, PC5, PD12, PD11, AF7),
    USART3: (PB10, PC11, PB1, PA6, AF7),
    USART3: (PB10, PC11, PB1, PB13, AF7),
    USART3: (PB10, PC11, PB1, PD11, AF7),
    USART3: (PB10, PC11, PB14, PA6, AF7),
    USART3: (PB10, PC11, PB14, PB13, AF7),
    USART3: (PB10, PC11, PB14, PD11, AF7),
    USART3: (PB10, PC11, PD2, PA6, AF7),
    USART3: (PB10, PC11, PD2, PB13, AF7),
    USART3: (PB10, PC11, PD2, PD11, AF7),
    USART3: (PB10, PC11, PD12, PA6, AF7),
    USART3: (PB10, PC11, PD12, PB13, AF7),
    USART3: (PB10, PC11, PD12, PD11, AF7),
    USART3: (PC4, PC11, PB1, PA6, AF7),
    USART3: (PC4, PC11, PB1, PB13, AF7),
    USART3: (PC4, PC11, PB1, PD11, AF7),
    USART3: (PC4, PC11, PB14, PA6, AF7),
    USART3: (PC4, PC11, PB14, PB13, AF7),
    USART3: (PC4, PC11, PB14, PD11, AF7),
    USART3: (PC4, PC11, PD2, PA6, AF7),
    USART3: (PC4, PC11, PD2, PB13, AF7),
    USART3: (PC4, PC11, PD2, PD11, AF7),
    USART3: (PC4, PC11, PD12, PA6, AF7),
    USART3: (PC4, PC11, PD12, PB13, AF7),
    USART3: (PC4, PC11, PD12, PD11, AF7),
    USART3: (PC10, PC11, PB1, PA6, AF7),
    USART3: (PC10, PC11, PB1, PB13, AF7),
    USART3: (PC10, PC11, PB1, PD11, AF7),
    USART3: (PC10, PC11, PB14, PA6, AF7),
    USART3: (PC10, PC11, PB14, PB13, AF7),
    USART3: (PC10, PC11, PB14, PD11, AF7),
    USART3: (PC10, PC11, PD2, PA6, AF7),
    USART3: (PC10, PC11, PD2, PB13, AF7),
    USART3: (PC10, PC11, PD2, PD11, AF7),
    USART3: (PC10, PC11, PD12, PA6, AF7),
    USART3: (PC10, PC11, PD12, PB13, AF7),
    USART3: (PC10, PC11, PD12, PD11, AF7),
}

#[cfg(any(feature = "stm32l4x2", feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    USART3: (PB10, PB11, PB1, AF7),
    USART3: (PB10, PB11, PB14, AF7),
    USART3: (PB10, PB11, PD2, AF7),
    USART3: (PB10, PB11, PD12, AF7),
    USART3: (PC4,  PB11, PB1, AF7),
    USART3: (PC4,  PB11, PB14, AF7),
    USART3: (PC4,  PB11, PD2, AF7),
    USART3: (PC4,  PB11, PD12, AF7),
    USART3: (PC10, PB11, PB1, AF7),
    USART3: (PC10, PB11, PB14, AF7),
    USART3: (PC10, PB11, PD2, AF7),
    USART3: (PC10, PB11, PD12, AF7),
    USART3: (PB10, PC5,  PB1, AF7),
    USART3: (PB10, PC5,  PB14, AF7),
    USART3: (PB10, PC5,  PD2, AF7),
    USART3: (PB10, PC5,  PD12, AF7),
    USART3: (PC4,  PC5,  PB1, AF7),
    USART3: (PC4,  PC5,  PB14, AF7),
    USART3: (PC4,  PC5,  PD2, AF7),
    USART3: (PC4,  PC5,  PD12, AF7),
    USART3: (PC10, PC5,  PB1, AF7),
    USART3: (PC10, PC5,  PB14, AF7),
    USART3: (PC10, PC5,  PD2, AF7),
    USART3: (PC10, PC5,  PD12, AF7),
    USART3: (PB10, PC11, PB1, AF7),
    USART3: (PB10, PC11, PB14, AF7),
    USART3: (PB10, PC11, PD2, AF7),
    USART3: (PB10, PC11, PD12, AF7),
    USART3: (PC4,  PC11, PB1, AF7),
    USART3: (PC4,  PC11, PB14, AF7),
    USART3: (PC4,  PC11, PD2, AF7),
    USART3: (PC4,  PC11, PD12, AF7),
    USART3: (PC10, PC11, PB1, AF7),
    USART3: (PC10, PC11, PB14, AF7),
    USART3: (PC10, PC11, PD2, AF7),
    USART3: (PC10, PC11, PD12, AF7),
}

// UART 4
#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    // UART4: (tx: (PA0, PC10), rx: (PA1, PC11), rts: (PA15), cts: (PB7), AF8),
    UART4: (PA0, PA1, AF8),
    UART4: (PC10, PA1, AF8),
    UART4: (PA0, PC11, AF8),
    UART4: (PC10, PC11, AF8),
}

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    UART4: (PA0, PA1, PA15, PB7, AF8),
    UART4: (PC10, PA1, PA15, PB7, AF8),
    UART4: (PA0, PC11, PA15, PB7, AF8),
    UART4: (PC10, PC11, PA15, PB7, AF8),
}

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    UART4: (PA0, PA1, PA15, AF8),
    UART4: (PC10, PA1, PA15, AF8),
    UART4: (PA0, PC11, PA15, AF8),
    UART4: (PC10, PC11, PA15, AF8),
}

// UART 5
#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    // UART5: (tx: (PC12), rx: (PD2), rts: (PB4), cts: (PB5), AF8),
    UART5: (PC12, PD2, AF8),
}

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    UART5: (PC12, PD2, PB4, PB5, AF8),
}

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    UART5: (PC12, PD2, PB4, AF8),
}

pub enum Parity {
    ParityNone,
    ParityEven,
    ParityOdd,
}

